app/controllers/dvds_controller.rb

  def show
    # show a specific dvd with dvd listing id.
    id = params[:id]
    #render :text => "ID of the DVD is #{id}"
    @dvd = Dvd.find(id)
    @listings = Listing.find_all_by_dvd_id(@dvd.id.to_s)
---
SELECT * FROM `dvds` WHERE (`dvds`.`id` = 2)
SELECT * FROM `listings` WHERE (`listings`.`dvd_id` = '1')