app/controllers/listings_controller.rb

  def index

    if (!request.env['QUERY_STRING'].nil?)
      # This addresses the app login problem, previously it was directed to index.html.erb
      # previously, it was directed to http://web1.tunnlr.com:10337//?auth_token=9ab1b965ac6337d34dbb135927d54767
      # now, it gets redirect to http://apps.facebook.com/dvdflex

      case DVDFLEX_ENV
        when 'dev'
          redirect_to "http://apps.facebook.com/dvdflex_dev"
        when 'test'
          redirect_to "http://apps.facebook.com/dvdflex_test"
        when 'prod'
          redirect_to "http://apps.facebook.com/dvdflex"
      end

    end


    if params[:user_id]
      # find listings with userid
      @user = User.find(params[:user_id])
    else
      # find listings of the current user
      @user = current_user
      # classic way of finding friends
      @list_of_friends = (params[:fb_sig_friends]||"").split(/,/)
      # API way of finding friends. not working as of now
      # @list_of_friends = @user.facebook_session.user.friends
      @friends_listings = Listing.find_for_friends(@list_of_friends)
---
SELECT * FROM `listings` WHERE (`listings`.user_id = 1)

  def show
    # show detail of an individual dvd listings
    # to do, need to fix the routing in index.fbml.erb
    @listing = Listing.find(params[:id])
---
SELECT * FROM `listings` WHERE (`listings`.`id` = 1)